In [1]:
# import libraries
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.impute import SimpleImputer

In [2]:
dataset = sns.load_dataset('titanic') # load dataset from seaborn library
dataset.head() # display first 5 rows of the dataset

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# impute age column using simpleimputer from sklearn
imputer = SimpleImputer(strategy='median') # set strategy to 'median' to impute missing values with median of the existing values in that column.
dataset['age'] = imputer.fit_transform(dataset[['age']]) # impute missing values in 'age' column using imputer object and fit the imputer object to the 'age' column.

In [4]:
dataset.isnull().sum().sort_values(ascending=False) # check for missing values in each column and display in descending order

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [5]:
dataset.drop('deck' , axis=1, inplace=True) # drop 'deck' column from the dataset because it has a lot of missing values

In [7]:
dataset.isnull().sum().sort_values(ascending=False) # check for missing values in each column and display in descending order

embarked       2
embark_town    2
survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
class          0
who            0
adult_male     0
alive          0
alone          0
dtype: int64

In [8]:
dataset['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [9]:
# Convert "embark_town" column to numerical representation
embark_town_mapping = {'Southampton': 0, 'Cherbourg': 1, 'Queenstown': 2}
dataset['embark_town'] = dataset['embark_town'].map(embark_town_mapping)

In [10]:
dataset['embark_town'].value_counts()

embark_town
0.0    644
1.0    168
2.0     77
Name: count, dtype: int64

In [11]:
dataset.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,0.0,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,1.0,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,0.0,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,0.0,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,0.0,no,True

In [12]:
imputer = SimpleImputer(strategy='most_frequent') # Create SimpleImputer object

In [13]:
dataset['embark_town'] = imputer.fit_transform(dataset[['embark_town']]) # Fill missing values in the "embark_town" column

In [14]:
# Convert "embark_town" column back to original categorical representation
embark_town_mapping_inv = {v: k for k, v in embark_town_mapping.items()}
dataset['embark_town'] = dataset['embark_town'].map(embark_town_mapping_inv)

In [15]:
dataset['embark_town'].value_counts()

embark_town
Southampton    646
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [16]:
dataset.isnull().sum().sort_values(ascending=False)

embarked       2
survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64